import React from 'react';
import { View, ScrollView } from 'react-native';
import { Dialog, Portal, Provider, Text } from 'react-native-paper';
// imports ////////////////////////////////

// react function /////////////////////////
export default function file({ visible, onDismiss }) {
  // local hooks:

  // local handlers:

  // local ui:
  return (
    <Provider>
      <Portal>
        <Dialog visible={visible} onDismiss={onDismiss}>
          <Dialog.ScrollArea>
            <ScrollView contentContainerStyle={{ paddingHorizontal: 24 }}>
              <View>
                <Text variant="headlineLarge">شروط وأحكام غسيل</Text>

                <View>
                  <Text variant="labelMedium">
                    عندما تحجز عبر موقع الويب على ghaseel.com أو عبر التطبيق
                    ("الموقع" كليًا) ، يجب عليك قراءة البنود والشروط ("الشروط")
                    الخاصة بالحجز والموافقة عليها قبل تحديد موعد. بمجرد تحديد
                    موعد ، فإنك ملزم بموجب الشروط الواردة هنا.
                  </Text>
                </View>

                <View>
                  <Text variant="headlineLarge">رخصة</Text>
                  <List.Item
                    title="      من خلال عرض هذا الموقع للاستخدام ، يقدم Ghaseel ترخيصًا عالميًا غير
          حصري وغير قابل للتحويل وقابل للإلغاء ومحدود للوصول إلى المعلومات
          والخدمات الموجودة على هذا الموقع واستخدامها بشكل شخصي ، تخضع بشكل صارم
          لهذه الشروط وبما يتماشى معها. يحتفظ Ghaseel بالحق في تعديل أو إنهاء
          هذا الترخيص في أي وقت ولأي سبب."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="قد يؤدي عدم الامتثال لهذه الشروط إلى الإنهاء التلقائي لهذا الترخيص ،
          دون إشعار مسبق. باستثناء الترخيص المحدود المنصوص عليه في هذه الشروط ،
          لا يمنحك Ghaseel أي حقوق أو تراخيص صريحة أو ضمنية بموجب أي براءات
          اختراع أو علامات تجارية أو حقوق نشر أو مواد أخرى مملوكة."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                </View>

                <View>
                  <Text variant="headlineLarge">شروط وأحكام الحجز</Text>
                  <Text variant="labelMedium">
                    يجب على العملاء إزالة جميع المتعلقات الشخصية والأموال
                    والأشياء المهمة الأخرى من سيارتهم قبل أن نقدم خدمتنا.
                  </Text>
                  <List.Item
                    title="  لن يكون Ghaseel مسؤولاً عن أي مسؤولية تنشأ عن أي ضرر أو خسارة لأي
          ممتلكات شخصية بما في ذلك السيارة التي يتم صيانتها أو أي ممتلكات داخل
          السيارة أو إلى موقع الخدمة. تقع على عاتقك مسؤولية التأكد من أن سيارتك
          يتم صيانتها في منطقة قانونية وآمنة ، وإذا كنت تشعر بخلاف ذلك ، فيرجى
          إبلاغ وكيل الخدمة لدينا بمخاوفك."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />{' '}
                  <List.Item
                    title="يتم تنظيف جميع المركبات على مسؤولية العميل الخاصة ويجب أن تكون قادرة
          على تحمل عمليات التنظيف العادية."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="بينما سيتم بذل كل محاولة للحفاظ على الحجوزات المنتظمة في نفس اليوم
          والوقت كل أسبوع ، قد يُطلب منا في بعض الأحيان إجراء تغييرات ولكننا
          سنحاول إبلاغ التغييرات قبل وصول وكيل الخدمة لدينا."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="نحتفظ بالحق في الحصول على تفاصيل بطاقة الخصم أو الائتمان لتأمين الحجز."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />{' '}
                  <List.Item
                    title="    نحتفظ بالحق في تعديل أو نقل الحجز بما يتماشى مع مستويات التوظيف و / أو
          الظروف الجوية و / أو تعطل الآلات أو المعدات أو أي صعوبة."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />{' '}
                  <List.Item
                    title="تتطلب جميع الطلبات المقدمة التحقق من العنوان والحزمة وحالة السيارة. لا
          يتم ضمان طلبات الخدمة في وقت الحجز ويمكن إلغاؤها في أي وقت وفقًا
          لتقدير Ghaseel المطلق. لغسيل الحق في رفض الخدمة لأي شخص."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />{' '}
                  <List.Item
                    title="يحتفظ Ghaseel بالحق في رفض أو رفض طلبات العملاء بما يتجاوز الخدمة
          المحجوزة."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />{' '}
                  <List.Item
                    title="لن تتسامح Ghaseel مع أي إساءة لفظية أو جسدية تجاه أي من موظفيها تحت أي
          ظرف من الظروف ، وسوف تتخذ الإجراءات ذات الصلة في حالة مواجهة أي من هذه
          السلوكيات"
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />{' '}
                </View>

                <View>
                  <Text variant="headlineLarge">شروط وأحكام التسعير</Text>
                  <List.Item
                    title="يتم عرض جميع الأسعار في قائمة الخدمة الخاصة بنا والتي يمكن العثور
          عليها على الموقع. نحتفظ بالحق في تغيير الأسعار دون إشعار مسبق."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />{' '}
                  <List.Item
                    title="  سيتم تطبيق رسوم إضافية بنسبة 20٪ كحد أدنى على أي خدمة تتضمن شعر
          الحيوانات الأليفة المفرط أو القيء أو البول أو الدم أو البراز أو غيرها
          من المواد الخطرة."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />{' '}
                  <List.Item
                    title="تعتمد أسعارنا على نوع الخدمة والموقع ونوع السيارة وحالة السيارة."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="يحتفظ Ghaseel بالحق في شحن كل سيارة حسب حالتها ونوع السيارة وموقع
          العميل."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                </View>

                <View>
                  <Text variant="headlineLarge">مجال الاتصالات</Text>
                  <List.Item
                    title="  سيقوم Ghaseel بإرسال رسائل نصية قصيرة SMS للتحقق من طلب الخدمة الخاص
          بك ، وإرسال معلومات عن وكيل الخدمة ، وإجراء استبيان رضا العملاء بعد
          انتهاء الخدمة. اعتمادًا على خدمة الهاتف المحمول الخاصة بك ، قد تتحمل
          تكاليف من هذه الرسائل النصية القصيرة SMS من مزود خدمة الهاتف المحمول
          الخاص بك. Ghaseel ليست مسؤولة عن أي من هذه التكاليف المحتملة."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="  قد يتصل بك Ghaseel مباشرة لتحديد موعد خدمتك أو إجراء استبيان رضا
          العملاء. في حالة إلغاء الطلب ، قد نتصل بك لمعرفة أسباب إلغاء الطلب."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="قد يتم تسجيل جميع مكالمات خدمة العملاء الواردة والصادرة من أجل ضمان
          الجودة."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                </View>

                <View>
                  <Text variant="headlineLarge">شروط خدمتنا</Text>
                  <List.Item
                    title="قد نسألك أين سمعت عن Ghaseel لتقييم استراتيجياتنا التسويقية"
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="  قد نجري استطلاعات رضا العملاء."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="  سنطلب إذنك للاحتفاظ بتفاصيل بطاقة الخصم أو بطاقة الائتمان لتأمين حجز
          منتظم."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="نحتفظ بالحق في خصم المبلغ بالكامل من بطاقة الخصم أو الائتمان حتى إذا
          لم تكن السيارة متاحة للتنظيف ولم يتم إلغاء الحجز مسبقًا."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                </View>

                <View>
                  <Text variant="headlineLarge">
                    القيود المفروضة على الوصول إلى الموقع واستخدامه
                  </Text>
                  <Text variant="labelMedium">
                    أنت تقبل الوصول إلى الموقع أو استخدامه بشكل صارم لأغراض
                    مشروعة. أنت توافق على أنك لن تستخدم أي جهاز أو برنامج أو
                    وسيلة أخرى لإعاقة أو محاولة إعاقة الأداء السليم للموقع ،
                    وأنك لن تشرع في أي إجراء أو نية تؤدي إلى حمل كبير غير معقول
                    أو غير متناسب على بنيتنا التحتية أو نظامنا. أنت توافق أيضًا
                    على أنك لن تستخدم أي روبوت أو عنكبوت أو أجهزة آلية أخرى أو
                    عملية يدوية لمراقبة أو نسخ تطبيقنا أو المحتوى المضمن هنا ،
                    دون الحصول على موافقة صريحة مسبقة من Ghaseel.
                  </Text>
                </View>

                <View>
                  <Text variant="headlineLarge">شروط وأحكام الإلغاء</Text>
                  <List.Item
                    title="نتوقع إشعار مدته ساعة إلى ساعتين لإلغاء أي خدمة حجز .."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />{' '}
                  <List.Item
                    title="سيؤدي عدم تقديم إشعار الإلغاء هذا على الفور إلى خصم 15٪ كحد أدنى من
          تكلفة الخدمة."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />{' '}
                  <List.Item
                    title="تتطلب المواعيد التي تم إلغاؤها في نفس اليوم رسمًا بنسبة 15٪ من تكلفة
          الخدمة."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />{' '}
                  <List.Item
                    title="يحتفظ Ghaseel بالحق في الحصول على السداد الكامل إذا تم إلغاء الحجز في
          اليوم دون اتفاق مسبق."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="  يحتفظ Ghaseel بالحق في تغيير أو تعديل وقت / تاريخ الحجز دون عقوبة ولكن
          حيثما أمكن ذلك سيُعلم العميل بذلك."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="  يحتفظ Ghaseel بالحق في تعديل الحجز أو نقل الحجز بما يتماشى مع مستويات
          موظفيه و / أو الظروف الجوية و / أو تعطل المعدات أو الصعوبة دون أي شكل
          من أشكال العقوبة أو المسؤولية تجاه الشركة."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />{' '}
                  <List.Item
                    title="سيؤدي عدم التواجد في وقت ومكان الخدمة المطلوبة إلى القيمة الكاملة
          للخدمة التي يتم تحصيلها."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                </View>

                <View>
                  <Text variant="headlineLarge">ضمان الخدمة</Text>
                  <List.Item
                    title="    إذا كان هناك سبب محتمل وواضح لعدم قيام وكيل الخدمة بالخدمة كما هو
          مطلوب أو كان هناك دليل واضح على أداء الخدمة الضعيف ، فسيقوم Ghaseel
          برد التكلفة أو إعادة الجزء غير المكتمل أو غير المرضي من الخدمة. ."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="تنظيف السيارة شخصيًا أو مهنيًا بعد الخدمة الأولية دون إذن من Ghaseel
          يلغي ضمان الخدمة لدينا. لن يتم توفير عمليات الإعادة أو الاسترداد أو
          السداد بعد أي تنظيف غير مصرح به."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="  إن عدم الكشف في وقت الحجز عن أي مشكلات مشروطة تشمل البقع الشديدة ، أو
          النفايات البيولوجية البشرية أو الحيوانية ، أو الروائح الكريهة ، أو
          العفن ، أو الانسكابات الكيميائية ، أو العفن ، أو الرش الكيميائي الزائد
          أو أي مواد أخرى غير مستقرة ، يؤدي إلى إبطال ضمان خدمتنا. لن يتم
          استرداد أي مبالغ أو عمليات إعادة أو أي عمل إضافي خارج الحزمة الأصلية
          أو التقدير."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="  يجب تقديم أي مطالبات في غضون 48 ساعة من إتمام الخدمة عبر الهاتف أو
          البريد الإلكتروني (support@ghaseel.com) أو إرسال مراجعة عبر الإنترنت.
          يجب إرسال صور المنطقة إلى support@ghaseel.com في غضون 24 ساعة من تقديم
          المطالبة."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                </View>

                <View>
                  <Text variant="headlineLarge">نرحب بالتعليقات</Text>
                  <Text variant="labelMedium">
                    كلما زاد عدد الاقتراحات التي يقدمها المستخدمون ، أصبحت
                    الخدمة أفضل. إذا أرسل لنا أحد المستخدمين أي ملاحظات أو
                    اقتراحات بخصوص الخدمات ، فهناك فرصة لاستخدامها ، لذلك يمنحنا
                    المستخدم ترخيصًا غير محدود وغير قابل للإلغاء ودائم وقابل
                    للترخيص من الباطن وقابل للتحويل وخالي من حقوق الملكية
                    لاستخدام أي من هذه التعليقات أو الاقتراحات من أجل لأي غرض
                    دون أي التزام أو تعويض للمستخدم. إذا اخترنا عدم تنفيذ
                    الاقتراح ، فالرجاء عدم التعامل معه على محمل شخصي. نحن نقدر
                    ذلك مع ذلك.
                  </Text>
                </View>

                <View>
                  <Text variant="headlineLarge">قوة قهرية</Text>
                  <Text variant="labelMedium">
                    لن نكون مسؤولين بسبب أي فشل أو تأخير في أداء التزاماتنا بسبب
                    أحداث خارجة عن سيطرتنا المعقولة ، والتي قد تشمل الإضرابات
                    وأعمال الشغب والحرائق والقدر والحرب والإرهاب والإجراءات
                    الحكومية.
                  </Text>
                </View>
                <View>
                  <Text variant="headlineLarge">إخلاء المسؤولية</Text>
                  <Text variant="labelMedium">
                    بموجب هذا يقر ويضمن Ghaseel أنه لا الخدمة ولا استخدامها كما
                    هو معروض هنا سيكون أي شكل من أشكال التعدي على حقوق أي طرف
                    ثالث أو انتهاك أي قوانين أو لوائح معمول بها ، مثل قوانين
                    حقوق النشر والعلامات التجارية وبراءات الاختراع. ما لم يتم
                    النص صراحةً في هذه الاتفاقية ، لا يقدم Ghaseel أي ضمان ،
                    بشكل مباشر أو غير مباشر ، فيما يتعلق بأي مسألة ، بما في ذلك
                    على سبيل المثال لا الحصر الإعلان وأي خدمات أخرى ، ويتنصل
                    بوضوح من الضمانات أو الشروط المستنبطة الخاصة بعدم الانتهاك ،
                    والقابلية للتسويق ، والملاءمة لأي سبب. لا نقدم أي ضمانات على
                    نتائج استخدام الخدمة ، ويتحمل المستخدم جميع المخاطر
                    والمسؤولية فيما يتعلق بها.
                  </Text>
                </View>
                <View>
                  <Text variant="headlineLarge">تحديد المسؤولية</Text>
                  <Text variant="labelMedium">
                    استخدام الموقع على مسؤوليتك الخاصة. يتم توفير الموقع على
                    أساس "كما هي". إلى الحد الأقصى الذي يسمح به القانون: (أ)
                    يخلي غزل مسؤوليته مهما كانت ، سواء كانت ناشئة عن عقد أو ضرر
                    (بما في ذلك الإهمال) أو غير ذلك فيما يتعلق بالموقع ؛ و (ب)
                    جميع الضمانات والشروط والأحكام الضمنية المتعلقة بالموقع
                    (سواء كانت ضمنية بموجب القانون أو القانون العام أو غير ذلك)
                    ، بما في ذلك (على سبيل المثال لا الحصر) أي ضمان أو شرط أو
                    شرط فيما يتعلق بالدقة أو الاكتمال لغرض أو أي غرض خاص ، فإن
                    التوافر وعدم الانتهاك ودقة المعلومات وقابلية التشغيل
                    المتبادل والاستمتاع الهادئ ، كما هو مستبعد بينك وبين جاسيل.
                    على وجه الخصوص ، ولكن دون تحفظ لما سبق ، فإننا لا نتحمل أي
                    مسؤولية عن أي إخفاق تقني للإنترنت و / أو التطبيق ؛ أو أي ضرر
                    أو إصابة للمستخدمين أو أجهزتهم نتيجة استخدامهم للموقع أو
                    متعلقة به. لا تتأثر حقوقك القانونية.
                  </Text>
                  <Text variant="labelMedium">
                    لن يكون حسين مسؤولاً في العقد أو الضرر (بما في ذلك ، على
                    سبيل المثال لا الحصر ، الإهمال) ، بموجب القانون أو غير ذلك ،
                    نتيجة أو فيما يتعلق بالموقع ، عن أي: (1) الخسائر الاقتصادية
                    (بما في ذلك ، دون حصر) من الإيرادات أو الأرباح أو العقود أو
                    الأعمال التجارية أو المدخرات المتوقعة) ؛ أو (2) فقدان
                    النوايا الحسنة أو السمعة ؛ أو (3) الخسائر الخاصة أو غير
                    المباشرة أو التبعية.
                  </Text>
                </View>
                <View>
                  <Text variant="headlineLarge">التعويض</Text>
                  <Text variant="labelMedium">
                    يوافق المستخدم على تعويض وغسيل وموظفيه ومديريه وورثته
                    والمتنازل لهم عن أي مسؤولية أو ضرر أو خسارة أو مصاريف بما في
                    ذلك أتعاب المحاماة الناتجة عن نشر أو توزيع أو نقل أي إعلان
                    مقدم من قبل أو نيابة عنهم. أو ربط أي إعلان بأي مادة أخرى.
                    أنت توافق على تغطية Ghaseel بالكامل وعند الطلب من وضد أي
                    خسارة أو ضرر أو تكاليف أو نفقات يتكبدونها أو يتكبدونها بشكل
                    مباشر أو غير مباشر نتيجة أفعالك أثناء استخدام الموقع بخلاف
                    ما يتوافق مع هذه الشروط أو القوانين المعمول بها.
                  </Text>
                </View>

                <View>
                  <Text variant="headlineLarge">الاستقلالية</Text>
                  <Text variant="labelMedium">
                    إذا تم اعتبار أي جزء من هذه الشروط غير قابل للتنفيذ أو غير
                    صالح لأي سبب من الأسباب ، فسيتم تعديل هذا الجزء بالقدر
                    اللازم لمعالجة عدم قابلية التنفيذ أو عدم الصلاحية ، أو إذا
                    لم يكن من الممكن تصحيح عدم قابلية التنفيذ أو عدم الصلاحية ،
                    سيتم قطع هذا الجزء من هذه الشروط ، وبخلاف ذلك سيظل الجزء
                    الآخر من هذه الشروط ساريًا بالكامل.
                  </Text>
                </View>

                <View>
                  <Text variant="headlineLarge">تنازل</Text>
                  <Text variant="labelMedium">
                    لن يشكل أي إخفاق أو تأخير من قبل أي من الطرفين في ممارسة أي
                    حق بموجب الشروط تنازلاً عن هذا الحق. لن يكون أي تنازل بموجب
                    الشروط ساريًا ما لم يتم كتابيًا وموقعًا من قبل ممثل مفوض
                    للطرف الذي يعتبر أنه منح التنازل.
                  </Text>
                </View>
                <View>
                  <Text variant="headlineLarge">تحلل</Text>
                  <Text variant="labelMedium">
                    تحل أي التزامات ومسؤوليات متكبدة قبل تاريخ حل هذه الشروط محل
                    حل هذه الاتفاقية لجميع الأغراض.
                  </Text>
                  <Text variant="labelMedium">
                    تظل هذه الشروط سارية وحاكمة حتى يتم حلها من قبلك أو من
                    قبلنا. يمكنك إلغاء هذه الشروط في أي فترة بإخبارنا أنك لم تعد
                    ترغب أو ترغب في الوصول إلى الخدمات أو استخدامها ، أو عند
                    التوقف عن استخدام أي من الخدمات.
                  </Text>
                  <Text variant="labelMedium">
                    إذا أخفقت أو رفضت ، بناءً على تقديرنا المطلق ، أو لاحظنا أو
                    نشك في أنك قد فشلت أو رفضت ، الالتزام بأي من الأحكام الواردة
                    في هذه الشروط ، فيجوز لنا أيضًا إلغاء هذه الاتفاقية في أي
                    فترة دون إشعار مسبق وأنت سيظل مسؤولاً قانونًا عن جميع
                    المبالغ المستحقة حتى تاريخ الحل ومعه ؛ و / أو بالتالي قد
                    يمنعك من الوصول إلى أي جانب من جوانب الخدمات.
                  </Text>
                </View>

                <View>
                  <Text variant="headlineLarge">خرق هذه الشروط</Text>
                  <Text variant="labelMedium">
                    إذا انتهكت أو انتهكت بأي شكل من الأشكال أيًا من الحقوق أو
                    الأحكام المنصوص عليها في هذه الشروط ، أو إذا اشتبهنا بشكل
                    معقول في أنك قد انتهكت أو انتهكت أيًا من الحقوق أو الأحكام
                    المنصوص عليها في هذه الشروط بأي شكل من الأشكال ، فإننا نحتفظ
                    بالحق لفرض عواقب معينة ، والتي تشمل ل
                  </Text>
                  <List.Item
                    title="منحك تحذيرًا رسميًا واحدًا أو أكثر ؛"
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="  تعليق وصولك إلى الخدمات أو استخدامها مؤقتًا ؛"
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="عدم السماح لك بشكل دائم بالوصول إلى الخدمات أو استخدامها."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="  تقييد أجهزة الكمبيوتر التي تستخدم عنوان IP الخاص بك من الوصول إلى
          الخدمات."
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="اتصل بأي من مزودي خدمة الإنترنت أو جميعهم واطلب منهم عدم السماح لك
          بالوصول إلى الخدمات أو استخدامها:"
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                  <List.Item
                    title="رفع دعوى قانونية ضدك ، سواء بسبب خرق / خرق العقد أو غير ذلك ؛ و / أو"
                    left={(props) => (
                      <List.Icon {...props} icon="circle-small" />
                    )}
                  />
                </View>
                <View>
                  <Text variant="headlineLarge">اتفاق كامل</Text>
                  <Text variant="labelMedium">
                    تشكل هذه الشروط الاتفاقية الكاملة بينك وبين Ghaseel فيما
                    يتعلق بموضوعها ، وتلغي وتحل محل أي إصدارات سابقة من الشروط.
                    لا يجوز لك تخصيص أو نقل هذه الشروط أو أي حق ممنوح أدناه. قد
                    تخضع أيضًا لشروط وأحكام إضافية قد تنطبق عند استخدامك لمنتجات
                    Ghaseel أو منتجات أو خدمات الطرف الثالث.
                  </Text>
                </View>
              </View>
            </ScrollView>
          </Dialog.ScrollArea>
        </Dialog>
      </Portal>
    </Provider>
  );
}
